[
  {
    "listing_id": "679dae740fc1f0795eacccf6ccf3b10eb6c54f05",
    "property_id": "679dae740fc1f0795eacccf6ccf3b10eb6c54f05",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2000-Bagby-St-77002/unit-7414/home/29515607",
    "scraped_timestamp": "2025-09-23T12:05:02.461Z",
    "list_date": "2025-09-20",
    "days_on_market": 73,
    "description": "Live in the heart of Midtown and enjoy walkable access to top restaurants, bars, coffee shops, and entertainment. This updated condo offers the perfect blend of location and lifestyle, just minutes from Montrose and River Oaks for shopping, fitness studios, and weekend fun. Ideal for professionals or creatives who want to stay close to the action, yet enjoy a comfortable and low-maintenance home base. The layout offers great function and flow, with modern finishes, a private patio, and assigned parking. Whether you're working remotely, exploring the local food scene, or heading downtown, this home puts it all within reach. Midtown living at its best! Parking spots are 168 and 169. Guest parking is available for a daily fee.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "1971aeef84755d0fd9181d201579e19887ea0ed7",
    "property_id": "1971aeef84755d0fd9181d201579e19887ea0ed7",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2016-Main-St-77002/unit-1904/home/29503130",
    "scraped_timestamp": "2025-09-23T12:05:33.954Z",
    "list_date": "2025-08-20",
    "days_on_market": 33,
    "description": "Large 2x2 on the 19th floor, incredible view of Midtown. Open kitchen with a view of the dining/living area. French doors to the master bedroom. 2 balconies. Located on the light rail, walking distance to midtown/downtown eateries, theaters, clubs, pubs, shopping, and grocery stores. Bayou running/cycling trails are close by. Assigned garage parking, 1 storage unit. Close to: UofH, Rice, and STX Law. BILLS INCLUDED: electricity, heating/cooling, cable, internet, water, trash.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "5203fe48820920771f37ddee0aa8c00a8689b231",
    "property_id": "5203fe48820920771f37ddee0aa8c00a8689b231",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2000-Bagby-St-77002/unit-7416/home/29515609",
    "scraped_timestamp": "2025-09-23T12:05:56.149Z",
    "list_date": "2025-09-03",
    "days_on_market": 19,
    "description": "Experience luxurious urban living in this 2-bedroom, 2-bath executive mid-rise loft featuring concrete floors, floor-to-ceiling windows, a gourmet island kitchen, and a dramatic loft space. Enjoy stunning Houston views, a rooftop infinity pool, spa, bamboo garden, and more—all within walking distance to restaurants, parks, and shopping.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "a5937744c74ea318dccc3df0705b95e3126c9479",
    "property_id": "a5937744c74ea318dccc3df0705b95e3126c9479",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2000-Bagby-St-77002/unit-5423/home/29515583",
    "scraped_timestamp": "2025-09-23T12:06:33.756Z",
    "list_date": "2025-09-20",
    "days_on_market": 20,
    "description": "Urban living meets industrial charm in this stylish 1 bedroom, 1.5 bath loft in the heart of Midtown. Perched on the 5th floor of Rise Lofts, this home features high ceilings, stained concrete floors, and dramatic floor to ceiling windows that flood the space with natural light. Step outside to the Zen garden and community terrace—a rare and peaceful bonus just beyond your balcony door. The open layout includes a spacious living area and a functional kitchen ready for your personal touch. Off the dining area, you’ll find a half bath and laundry room. Upstairs, the loft style bedroom offers a sitting area, generous closet space, and an en-suite bath. Highlights include a brand-new HVAC system with two condensers installed in 2024, assigned parking, 24-hour concierge, secure access, and a rooftop pool with sweeping city views. All of this in a walkable Midtown location, surrounded by some of Houston’s best restaurants, nightlife, green space, and local favorites.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "d19ceee0516030dac8b4a455e9e51bfb1983fbac",
    "property_id": "d19ceee0516030dac8b4a455e9e51bfb1983fbac",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2000-Bagby-St-77002/unit-13430/home/29515791",
    "scraped_timestamp": "2025-09-23T12:07:10.482Z",
    "list_date": "2025-09-01",
    "days_on_market": 21,
    "description": "A rare penthouse feel without the penthouse price tag located in the vibrant heart of Midtown, including Midtown's hottest attractions and amenities conveniently located within walking distance. This exquisite luxury condo is perched on a coveted top corner from the rooftop infinity pool, ensuring convenience and elite status. Two-story, floor-to-ceiling glass windows highlight mesmerizing downtown corner views from dual perspectives and an expansive wrap-around balcony. Inside, the first floor captivates with its industrial-chic aesthetic, featuring stained concrete floors. Soaring ceilings, open floor plan, and spacious kitchen, boasting a large island and a private wet bar, perfect for entertaining. The dining area flows seamlessly into a grand living room. Upstairs, the primary bedroom offers a sanctuary of spacious luxury, including a recently remodeled ensuite with an oversized shower, dual sinks, and a generous walk-in closet, plus a secondary room with a secret office.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "3eed8e5b4fc82ba1fd59d7ec595dc7e40114fffe",
    "property_id": "3eed8e5b4fc82ba1fd59d7ec595dc7e40114fffe",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/201-Main-St-77002/unit-3H/home/29200990",
    "scraped_timestamp": "2025-09-23T12:10:10.941Z",
    "list_date": "2025-06-17",
    "days_on_market": 97,
    "description": "TWO assigned garage spaces. The Franklin Lofts is located in the heart of Houston's revitalized Downtown Historic District. Short distance from new food halls, innumerable outstanding restaurants, nightlife and parks. A few blocks from the Theater District walking distance to Daikin Park, the Toyota Center and with the Metro Rail steps away to comfortably get you to the Museum District, the Medical Center and NRG Stadium. The building built Main st. Promenade is being constructed right in front of the building. This sun-soaked unit has 3/4 inch hardwood floors and exposed brick walls throughout the expansive loft space. The generously sized kitchen has an inviting island complete with a breakfast bar, ample cabinets and gas cooking. Unwind in the roomy bedroom accompanied by a sizable walk-in closet. Enjoy the added benefits of an in-unit washer/dryer.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "2f0aac2eb3dbefa79c30f997ea98d71a9dc6a875",
    "property_id": "2f0aac2eb3dbefa79c30f997ea98d71a9dc6a875",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2016-Main-St-77002/unit-3/home/30489197",
    "scraped_timestamp": "2025-09-23T12:10:41.880Z",
    "list_date": "2025-05-09",
    "days_on_market": 136,
    "description": "Penthouse living with UNPARALLELED views in the heart of Houston. 3 bedrooms and an office with 2-1/2 bathrooms. This property is a dream for people that like to entertain. Spacious and looking for a new owner.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "bf9cc70b618e0575bcb5d48d452ffab7405dded8",
    "property_id": "bf9cc70b618e0575bcb5d48d452ffab7405dded8",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/300-St-Joseph-Pkwy-77002/unit-116/home/29591078",
    "scraped_timestamp": "2025-09-23T12:10:58.090Z",
    "list_date": "2025-09-20",
    "days_on_market": 81,
    "description": "This 2-bedroom, 2-bathroom condominium is located at The Edge in Midtown Houston. The unit has an open floor plan with natural light and a balcony for outdoor seating. The kitchen contains stainless appliances and granite countertops and connects to the living and dining areas. A breakfast bar is available with space for bar stools. Building amenities include a concierge, fitness center, pool, and other facilities. Call today.",
    "listing_type": "Condo",
    "status": "For sale",
    "title": null
  },
  {
    "listing_id": "13eb930264bfca4496991937de305169c0d70390",
    "property_id": "13eb930264bfca4496991937de305169c0d70390",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2006-Helena-St-77002/home/29412203",
    "scraped_timestamp": "2025-09-23T12:11:17.228Z",
    "list_date": "2025-09-05",
    "days_on_market": 17,
    "description": "Experience urban living at its best in this chic Midtown residence! Central location footsteps from trendy restaurants, cafes, bars, and green spaces for a walkable and vibrant lifestyle. If your work location is outside the 610 loop, easy highway access facilitates a commute that is against the flow of traffic. If your work is \"next door\" in Downtown, even better! Unwind in the comfortable, open main living areas or revel in stunning downtown views from the large 4th floor rooftop deck. This comfortable urban retreat has no shared walls and no HOA, custom shutters, stainless steel appliances and a new AC system from 2021. Each bedroom conveniently comes with its own bathroom, with the first bedroom on the ground floor and main living areas on the second. The primary bedroom and an extra bedroom are on the third floor. This elevator-ready house features a private gated driveway, oversized double garage, abundant extra storage space and a fenced yard with sprinkler system.",
    "listing_type": "For sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "2ed458bed5735fbce43e9c1903af912cca3b4d3b",
    "property_id": "2ed458bed5735fbce43e9c1903af912cca3b4d3b",
    "batch_id": "2025-09-23_zips25",
    "platform_id": "redfin",
    "source_url": "https://www.redfin.com/TX/Houston/2016-Main-St-77002/unit-2111/home/170217385",
    "scraped_timestamp": "2025-09-23T12:11:47.405Z",
    "list_date": "2025-08-29",
    "days_on_market": 24,
    "description": "Studio unit with full balcony (rare for studios in this building) and sensational downtown view from the 20th floor. Laminate floors, built-in wet-bar, open kitchen, and custom cabinets. HOA FEE INCLUDES: electricity, internet, cable, water, trash. COMMUNITY: 24/7/365 courtesy staff, limited access, resident lounge, free coffee bar, pool, gym, 1 assigned parking space, grills, party room, guest units, package rm, Amazon Locker. Located on the Rail. Walking distance to: bayou running & cycling trails, midtown/downtown parks & dog parks, eateries, theaters, shopping, hotels, grocery stores, and the 7-mile underground tunnel system. Instant access to I-45, I-10, and Hwy 59/288. Close to: Museums, TX Medical Center, UofH (Central and DT), TSU, Rice, St. Thomas, and S. TX. Law, Minute Maid Park, George R Brown, and Shell Soccer Stadium.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  }
]