[
  {
    "listing_id": "87e06389ce1d8e4b5856e099d35c39818af029f7",
    "property_id": "87e06389ce1d8e4b5856e099d35c39818af029f7",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/201-Main-St-UNIT-3H-Houston-TX-77002/62597240_zpid/",
    "scraped_timestamp": "2025-09-24T10:58:52.089Z",
    "list_date": "2025-06-17",
    "days_on_market": 98,
    "description": "This sun-soaked unit has 3/4 inch hardwood floors and exposed brick walls throughout the expansive loft space. The generously sized kitchen has an inviting island complete with a breakfast bar, ample cabinets and gas cooking. Unwind in the roomy bedroom accompanied by a sizable walk-in closet. Enjoy the added benefits of an in-unit washer/dryer.",
    "listing_type": "For sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "43d0bcd747af3b8177d7f4d158e8ad3404e8ac7b",
    "property_id": "43d0bcd747af3b8177d7f4d158e8ad3404e8ac7b",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/2000-Bagby-St-APT-7423-Houston-TX-77002/80582053_zpid/",
    "scraped_timestamp": "2025-09-24T10:50:43.654Z",
    "list_date": "2025-09-20",
    "days_on_market": 99,
    "description": "Ideal location for working Downtown/Heights/Medical Center. 2 level modern, serene industrial loft, made of glass, steel and soundproofing concrete. Balancing views with privacy; openness with definition; and light with shade. 512 sq ft elevated Primary bedroom and workspace. Separate yet interactive kitchen area with counter depth stainless steel appliances and oversized quartz counter height bar. Multi-purpose office/ dining/living area with floor to ceiling windows capturing Houston's celebrated - visually striking sunsets. Access to Houston's social summit - rooftop event area with lounge pool, jacuzzi with 2 professional gas grills and outdoor kitchens. Center of Houston's only substantial walking culture with Parks, Dog runs, bars, cafes, outdoor free concerts, dueling piano players, night clubs with a swimming pool, artists thriving and starving, busloads of astounded suburban tourists, theater, musicals, musicians, and the metro rail station.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "8e8409fc7c3b7d458c3043fbfb9530e637229788",
    "property_id": "8e8409fc7c3b7d458c3043fbfb9530e637229788",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/915-N-San-Jacinto-St-Houston-TX-77002/454882733_zpid/",
    "scraped_timestamp": "2025-09-24T10:59:48.779Z",
    "list_date": "2025-09-20",
    "days_on_market": 76,
    "description": "Zillow has 20 photos of this $224,900 1 bed, 1 bath, 1,242 sqft townhouse home located at 915 N San Jacinto St, Houston, TX 77002 built in 1986. MLS #46301032.",
    "listing_type": "For Sale",
    "status": "For Sale",
    "title": null
  },
  {
    "listing_id": "178c645f82f8eb4c0ff3dd8d5dca354428082033",
    "property_id": "178c645f82f8eb4c0ff3dd8d5dca354428082033",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/705-Main-St-UNIT-801-Houston-TX-77002/80552448_zpid/",
    "scraped_timestamp": "2025-09-24T11:00:11.208Z",
    "list_date": "2025-07-07",
    "days_on_market": 78,
    "description": "Situated in the vibrant core of Downtown Houston with views of Main Street, this top-floor, updated 2-bedroom, 2-bath loft offers striking design and character. Featuring true industrial elements like dramatic double-height concrete ceilings, exposed brick on two sides, wood floors, and expansive windows that flood the space with sunlight. The main level hosts the kitchen, living, dining areas, and a spacious secondary bedroom. Kitchen updates (per seller, 2017–2018) include custom cabinetry, cement counters, a large butcher block island, and stainless steel appliances. The secondary bedroom includes a study nook and ensuite bath. Upstairs, the primary suite features wood-look tile, a concrete ceiling, and a partial glass wall for added light. Refrigerator, washer, and dryer stay. One parking space, water, sewer, trash, fitness center, rooftop terrace, and lounge.",
    "listing_type": "sell",
    "status": "For Sale",
    "title": null
  },
  {
    "listing_id": "e7b69226441533403d36c3413a664d4efaac245f",
    "property_id": "e7b69226441533403d36c3413a664d4efaac245f",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/915-Franklin-St-UNIT-4A-Houston-TX-77002/58672104_zpid/",
    "scraped_timestamp": "2025-09-24T11:00:44.087Z",
    "list_date": "2025-06-16",
    "days_on_market": 99,
    "description": "Experience stunning skyline views from this spacious corner loft at Bayou Lofts. Featuring exposed brick, hardwood floors, and a smart open layout that lives larger than expected. The kitchen offers ample storage, a breakfast bar, and stylish finishes. The owner added a generous walk-in closet in the primary suite, plus a bath with separate tub and shower. Enjoy 24/7 concierge, fitness center, rooftop deck with splash pool, and a private storage cage. Includes two assigned parking spaces - a rare find in Downtown Houston. Located in the Historic District, just steps from Market Square Park, Bravery Chef Hall, dog parks, MetroRail, and all downtown attractions.",
    "listing_type": "For Sale",
    "status": "For Sale",
    "title": null
  },
  {
    "listing_id": "086042962f0bd08dfaf60252e7ca7e08df7b728b",
    "property_id": "086042962f0bd08dfaf60252e7ca7e08df7b728b",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/2016-Main-St-APT-620-Houston-TX-77002/439663205_zpid/",
    "scraped_timestamp": "2025-09-24T11:01:20.049Z",
    "list_date": "2025-07-22",
    "days_on_market": 63,
    "description": "Welcome to 2016 Main Street #620! Live in the heart of Midtown Houston in this 2-bed, 2-bath condo, which includes a washer & dryer in the unit, plus a smart split floor plan for added privacy. The custom kitchen features dual ovens and plenty of space to cook and entertain. Enjoy peace of mind with remote-controlled roll-down hurricane shutters on all windows, which lead to the expansive, slate-tiled terrace. Your monthly maintenance fee covers heating/cooling, water, trash, internet, cable, and common area insurance—keeping life simple. This mid/high-rise building offers full amenity living: outdoor pool and hot tub, fitness center, business lounge, and 24/7/365 security with a manned entrance. Convenience, comfort, and security—all in one of Houston’s most connected neighborhoods. Contact us today for a private tour!",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "60f1fdbe6826ff153ffcc33dfe912517c54d68ef",
    "property_id": "60f1fdbe6826ff153ffcc33dfe912517c54d68ef",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/2016-Main-St-PENTHOUSE-3-Houston-TX-77002/439686861_zpid/",
    "scraped_timestamp": "2025-09-24T11:01:46.828Z",
    "list_date": "2025-09-20",
    "days_on_market": 99,
    "description": "Penthouse living with UNPARALLELED views in the heart of Houston. 3 bedrooms and an office with 2-1/2 bathrooms. This property is a dream for people that like to entertain. Spacious and looking for a new owner. HOA FEE INCLUDES: electricity, internet, cable, water, trash (you need a router). COMMUNITY: 24/7/365 courtesy staff, limited access, resident lounge, free coffee bar, pool (currently being renovated), gym, 2 assgn parking spaces, grills, party rm, guest rm, package rm, Amazon Locker. Located on the Rail. Walking distance to: bayou running & cycling trails, midtown/downtown parks & dog parks, eateries, theaters, shopping, hotels, grocery stores and the 7 mile underground tunnel system. Instant access to I-45, I-10, and Hwy 59/288. Close to: Museums, TX Medical Center, UofH (Central and DT), TSU, Rice, St. Thomas, and S. TX. Law, Minute Maid Park, George R Brown and Shell Soccer Stadium. See video!",
    "listing_type": "For Sale",
    "status": "For Sale",
    "title": null
  },
  {
    "listing_id": "693b06610d08d6cbaaaeb0abcdf2ac95e29e8b95",
    "property_id": "693b06610d08d6cbaaaeb0abcdf2ac95e29e8b95",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/2016-Main-St-APT-1502-Houston-TX-77002/28388996_zpid/",
    "scraped_timestamp": "2025-09-24T11:02:18.488Z",
    "list_date": "2025-09-22",
    "days_on_market": 53,
    "description": "Stylish 2-bed, 2-bath condo with open-concept living, updated kitchen, granite countertops, wood floors, 3 balconies, and in-unit laundry. Enjoy stunning sunsets and unbeatable walkability to restaurants, pubs, and events. 2016 Main offers resort-style amenities including all utilities, pool, gym, coffee bar, package room, guest suites, and more, with easy access to major highways.",
    "listing_type": "For Sale",
    "status": "Active",
    "title": null
  },
  {
    "listing_id": "48087287c759f33f29357c6e42b1c3ef2b3fc22c",
    "property_id": "48087287c759f33f29357c6e42b1c3ef2b3fc22c",
    "batch_id": "2025-09-24_zips25",
    "platform_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/204-Travis-St-APT-4A-Houston-TX-77002/52411352_zpid/",
    "scraped_timestamp": "2025-09-24T11:02:49.622Z",
    "list_date": "2025-06-16",
    "days_on_market": 99,
    "description": "Beautifully renovated 1/1 corner unit at one of Downtown’s most preferred buildings, Hermann Lofts. Highlights include exposed brick walls, soaring 11’ cement ceilings, 10 windows, oak hardwood floors, open LR/DR/Kitchen & abundant storage! Kitchen boasts custom cabinetry, recycled glass countertops, stunning backsplash, gas cooking, refrigerator drawers & one-of-a-kind breakfast bar countertop made from reclaimed boxcar flooring. Bath has custom built vanity with double sinks & recycled glass countertops and oversized walk-in shower with frameless glass enclosure. 1 assigned garage space & storage cage included. Small boutique building of only 24 units. Monthly HOA fee includes building common area insurance & maintenance, water, sewer, trash, gas & fiber optic internet. Superior location in Downtown’s Historic District walkable to MetroRail, Market Sq. Park, POST Houston, Theater District, sporting venues, Buffalo Bayou Park, dining, bars & more! HOA PROHIBITS AIRBNB TYPE RENTALS.",
    "listing_type": "For sale",
    "status": "Active",
    "title": null
  }
]